<template>
  <AppNav />
  <div class="main">
    <NuxtPage />
  </div>
  <AppFooter />
</template>

<script setup lang="ts">
useHead({
  title: '峰益工具製刀廠-台中木工刀具，全鎢鋼木工鑽頭，排鑽鑽頭，取孔式鎢鋼鑽頭，直柄鑽頭，CNC，切削鑽孔，鎢鋼銑刀，直刀，槽刀，取木塞刀，外牙直柄鑽頭，鑽頭尺寸客製，鑽頭研磨',
  meta: [
    { name: 'keywords', content: '台中木工刀具，全鎢鋼木工鑽頭，排鑽鑽頭，取孔式鎢鋼鑽頭，直柄鑽頭，CNC，切削鑽孔，鎢鋼銑刀，直刀，槽刀，取木塞刀，外牙直柄鑽頭，鑽頭尺寸客製，鑽頭研磨' },
    {
      name: 'description',
      content:
        '峰益工具製刀廠創立於西元1985年，專業生產木工切削刀具，在木工刀具製造業始終秉持以服務客戶為最大宗旨。專業的製刀技術，提供客戶良好的客製化服務，不斷的研發與開發新的產品，提升產品對外的競爭力。'
    },
    {
      name: 'og:title',
      content: '峰益工具製刀廠-台中木工刀具，全鎢鋼木工鑽頭，排鑽鑽頭，取孔式鎢鋼鑽頭，直柄鑽頭，CNC，切削鑽孔，鎢鋼銑刀，直刀，槽刀，取木塞刀，外牙直柄鑽頭，鑽頭尺寸客製，鑽頭研磨'
    },
    {
      name: 'og:description',
      content:
        '峰益工具製刀廠創立於西元1985年，專業生產木工切削刀具，在木工刀具製造業始終秉持以服務客戶為最大宗旨。專業的製刀技術，提供客戶良好的客製化服務，不斷的研發與開發新的產品，提升產品對外的競爭力。'
    }
  ]
})
</script>
